## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ssm_parameter.api_auth_token will be created
  + resource "aws_ssm_parameter" "api_auth_token" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/scan-files/api_auth_token"
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.api.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:root"
                        }
                      - Sid       = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "api"
        name                  = "api"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "api"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "API_AUTH_TOKEN"          = (sensitive)
                # (2 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
